heatExchanger/constant/fins/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fins/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_fins
    {
        type            patch;
        nFaces          626;
        startFace       135891;
    }
    fins_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          40068;
        startFace       136517;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_fins;
    }
    fins_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          52;
        startFace       176585;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_fins;
    }
)

// ************************************************************************* //
