heatExchanger/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_fluid
    {
        type            patch;
        nFaces          58;
        startFace       234488;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          58;
        startFace       234546;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1948;
        startFace       234604;
    }
    fluid_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          40068;
        startFace       236552;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_fluid;
    }
)

// ************************************************************************* //
