heatExchanger/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet_fluid
    {
        type            patch;
        nFaces          58;
        startFace       412869;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          58;
        startFace       412927;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1948;
        startFace       412985;
    }
    walls_heater
    {
        type            patch;
        nFaces          256;
        startFace       414933;
    }
    base_fins
    {
        type            patch;
        nFaces          626;
        startFace       415189;
    }
)

// ************************************************************************* //
